---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtEnd
source: html/d631401f-f713-9ff4-770e-91950c209519.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHookRotationAtEnd Property

"Hook Rotation At End"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHookRotationAtEnd { get; }
```